Revit 2027 API
RebarContainerItem.SetFromRebar Method
 Set an instance of a RebarContainerItem element according to a Rebar parameters. Will throw exception if given rebar is not shape driven. Will throw exception if given rebar has moved bars in set.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetFromRebar(
	Rebar rebar
)
Public Sub SetFromRebar (
	rebar As Rebar
)
public:
void SetFromRebar(
	Rebar^ rebar
)
member SetFromRebar :
        rebar : Rebar -> unit
Parameters
rebar Rebar
 The Rebar.
Exceptions
Exception | Condition
ArgumentException |  Can't create container from Rebar with moved bars. -or- Can't create container from Rebar which has excluded bars other than the first and last one. -or- A RebarContainerItem cannot be created from a Free Form Rebar or from a Shape Driven Rebar whose Rebar Shape has End Treatments or Cranks or terminations' rotation angles are different than 0. -or- Can't create container from Rebar with Custom Spacing layout.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarContainerItem Class
Autodesk.Revit.DB.Structure Namespace